# Lab | Data Cleaning and Formatting

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

# Challenge 1: Data Cleaning and Formatting

## Exercise 1: Cleaning Column Names

To ensure consistency and ease of use, standardize the column names of the dataframe. Start by taking a first look at the dataframe and identifying any column names that need to be modified. Use appropriate naming conventions and make sure that column names are descriptive and informative.

*Hint*:
- *Column names should be in lower case*
- *White spaces in column names should be replaced by `_`*
- *`st` could be replaced for `state`*

In [4]:
import pandas as pd

df = pd.read_csv('https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv')
df.head()

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

In [5]:
df['GENDER'].unique()

array([nan, 'F', 'M', 'Femal', 'Male', 'female'], dtype=object)

In [6]:
# 1. convert all to lower case names
df.columns = df.columns.str.lower()
# would also work with the following lambda function; what's the better way?
# df.columns = map(lambda x: x.lower(), df.columns)

In [7]:
# 2. replacing " " with "_" in column names
df.columns = map(lambda x: x.replace(" ","_"), df.columns)
df.columns

Index(['customer', 'st', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

In [8]:
# i was trying before with the following code, which is however not as userfriendly:
#column_names = list(df.columns)
#new_column_names = []
#for col in range(len(column_names)):
#    new_col = column_names[col].replace(" ","_")
#    new_column_names.append(new_col)
#df.columns = new_column_names

In [9]:
# to replace the column name "ST" (by now its "st") with "state" the rename() method is applied
df = df.rename(columns={'st':'state'})
df.columns

Index(['customer', 'state', 'gender', 'education', 'customer_lifetime_value',
       'income', 'monthly_premium_auto', 'number_of_open_complaints',
       'policy_type', 'vehicle_class', 'total_claim_amount'],
      dtype='object')

## Exercise 2: Cleaning invalid Values

The dataset contains columns with inconsistent and incorrect values that could affect the accuracy of our analysis. Therefore, we need to clean these columns to ensure that they only contain valid data.

Note that this exercise will focus only on cleaning inconsistent values and will not involve handling null values (NaN or None).

Hint:

- Gender column contains various inconsistent values such as "F", "M", "Femal", "Male", "female", which need to be standardized, for example, to "M" and "F".

- State abbreviations be can replaced with its full name, for example "AZ": "Arizona", "Cali": "California", "WA": "Washington"

- In education, "Bachelors" could be replaced by "Bachelor"

- In Customer Lifetime Value, delete the % character

- In vehicle class, "Sports Car", "Luxury SUV" and "Luxury Car" could be replaced by "Luxury"

#### 1. Gender Column

In [10]:
df['gender'].unique()

array([nan, 'F', 'M', 'Femal', 'Male', 'female'], dtype=object)

In [11]:
# gender needs to be standardized to either "F" or "M"
# creating a lambda function that converts the data in column gender
        # to the first character of each string
# apply() applies the function to every data point in df['gender']

In [12]:
df['gender'] = df['gender'].apply(lambda x: x[0].upper() if pd.notnull(x) and x[0].upper() in ['M','F'] else x)
df['gender'].unique()

array([nan, 'F', 'M'], dtype=object)

In [13]:
## explaining the lambda function:
## the argument is here the data in the gender column (lambda iteratives through every row in column gender)
## the expression (= replaces data in column gender) takes the first character of each string and converts it
    # to upper case.
    # the condition checks if the uppercase first characer is "M" or "F" as well as if the data point is notnull.
        # if it is, the first uppercase character is returned
        # if it isn't, the original data (x) remains

#### 2. State

In [14]:
df['state'].unique()
# the abbreviated states AZ and WA that need to be replaced
## it could be that in the future even more states appear in abbrevations

array(['Washington', 'Arizona', 'Nevada', 'California', 'Oregon', 'Cali',
       'AZ', 'WA', nan], dtype=object)

In [15]:
# creating a dictionary that translates the abbrevations to their full state names
state_dict = {'AZ':'Arizona','Cali':'California','WA':'Washington'}

In [16]:
# replace each abbrevated state with its full state name on the basis of state_dict
df['state'] = df['state'].replace(state_dict)
df['state'].unique()

array(['Washington', 'Arizona', 'Nevada', 'California', 'Oregon', nan],
      dtype=object)

#### 3. Education

In [17]:
df['education'].unique()

array(['Master', 'Bachelor', 'High School or Below', 'College',
       'Bachelors', 'Doctor', nan], dtype=object)

In [18]:
# replacing 'Bachelors' with 'Bachelor'
df['education'] = df['education'].replace({'Bachelors':'Bachelor'})
df['education'].unique()

array(['Master', 'Bachelor', 'High School or Below', 'College', 'Doctor',
       nan], dtype=object)

#### 4. Customer Lifetime Value

In [19]:
display(df[['customer_lifetime_value']].head(3))
print(df['customer_lifetime_value'].dtypes)
#type is object

  customer_lifetime_value
0                     NaN
1              697953.59%
2             1288743.17%

object

In [20]:
# replacing '%' with nothing ('')
# applying it with a lambda function to all values in 'customer_lifetime_value'
df['customer_lifetime_value'] = df['customer_lifetime_value'].apply(lambda x: x.replace('%','') if pd.notnull(x) else x)

In [21]:
# changing the data type to float
df['customer_lifetime_value'] = df['customer_lifetime_value'].astype(float)
df['customer_lifetime_value'].dtypes

dtype('float64')

In [22]:
df[['customer_lifetime_value']].head(3)

   customer_lifetime_value
0                      NaN
1                697953.59
2               1288743.17

#### 5. Vehicle class

In [23]:
df['vehicle_class'].unique()

array(['Four-Door Car', 'Two-Door Car', 'SUV', 'Luxury SUV', 'Sports Car',
       'Luxury Car', nan], dtype=object)

In [24]:
# "Sports Car", "Luxury SUV" and "Luxury Car" replaced by "Luxury"
car_classes_dict = {'Sports Car':'Luxury','Luxury SUV':'Luxury','Luxury Car':'Luxury'}

In [25]:
# if needed, replace each car class with its replacement found in car_classes_dict
df['vehicle_class'] = df['vehicle_class'].replace(car_classes_dict)
df['vehicle_class'].unique()

array(['Four-Door Car', 'Two-Door Car', 'SUV', 'Luxury', nan],
      dtype=object)

## Exercise 3: Formatting data types

The data types of many columns in the dataset appear to be incorrect. This could impact the accuracy of our analysis. To ensure accurate analysis, we need to correct the data types of these columns. Please update the data types of the columns as appropriate.

It is important to note that this exercise does not involve handling null values (NaN or None).

*Hint*:
- *Customer lifetime value should be numeric*
- *Number of open complaints has an incorrect format. Look at the different values it takes with `unique()` and take the middle value. As an example, 1/5/00 should be 5. Number of open complaints is a string - remember you can use `split()` to deal with it and take the number you need. Finally, since it should be numeric, cast the column to be in its proper type.*

In [26]:
# Customer lifetime value type already changed  to float in exercise 2
df['customer_lifetime_value'].dtypes

dtype('float64')

In [27]:
df['number_of_open_complaints'].unique()

array(['1/0/00', '1/2/00', '1/1/00', '1/3/00', '1/5/00', '1/4/00', nan],
      dtype=object)

In [28]:
# splitting by "/" results in a list of 3 strings
# only want to keep the second string (-> [1])
df['number_of_open_complaints'] = df['number_of_open_complaints'].str.split(pat="/").str[1]
df['number_of_open_complaints'].unique()

array(['0', '2', '1', '3', '5', '4', nan], dtype=object)

## Exercise 4: Dealing with Null values

Identify any columns with null or missing values. Identify how many null values each column has. You can use the `isnull()` function in pandas to find columns with null values.

Decide on a strategy for handling the null values. There are several options, including:

- Drop the rows or columns with null values
- Fill the null values with a specific value (such as the column mean or median for numerical variables, and mode for categorical variables)
- Fill the null values with the previous or next value in the column
- Fill the null values based on a more complex algorithm or model (note: we haven't covered this yet)

Implement your chosen strategy to handle the null values. You can use the `fillna()` function in pandas to fill null values or `dropna()` function to drop null values.

Verify that your strategy has successfully handled the null values. You can use the `isnull()` function again to check if there are still null values in the dataset.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling null values.

After formatting data types, as a last step, convert all the numeric variables to integers using `applymap()`.

In [29]:
# checking null values of every column
print(df.isnull().sum())
print(df.shape)

customer                     2937
state                        2937
gender                       3054
education                    2937
customer_lifetime_value      2940
income                       2937
monthly_premium_auto         2937
number_of_open_complaints    2937
policy_type                  2937
vehicle_class                2937
total_claim_amount           2937
dtype: int64
(4008, 11)

In [30]:
# the data set has a lot of missing values in all columns (>50% per col)
# these is strange -> check if there are rows filled with NaNs in all columns
# if thats the case, these rows will be dropped
df = df.dropna(axis=0, how='all')

In [31]:
# check again, how many null values are remaining in every column
df.isnull().sum()

customer                       0
state                          0
gender                       117
education                      0
customer_lifetime_value        3
income                         0
monthly_premium_auto           0
number_of_open_complaints      0
policy_type                    0
vehicle_class                  0
total_claim_amount             0
dtype: int64

In [32]:
# most null values were cominig from rows that had no content at all (i assume this would have also appeared when
    # checking for duplicates)
# for further analysis, these rows are dropped

In [33]:
# columns to be dealt with for dealing with remaining nulls: gender and customer_lifetime_value

#### gender

In [34]:
print(df['gender'].value_counts(dropna=False))

gender
F      502
M      452
NaN    117
Name: count, dtype: int64

In [35]:
# By substituting all NaNs with the most frequent value, the data set would be falsified
# I would like to replace the NaNs by "D" standing for "Divers".
# This gender would be similar to something like "prefer not to say"

df.loc[:,'gender'] = df['gender'].fillna("D", axis=0)
print(df['gender'].value_counts(dropna=False))

gender
F    502
M    452
D    117
Name: count, dtype: int64

#### Customer Lifetime Value

In [36]:
# Column has only 3 rows with NaN -> it's safe to drop these rows as well as to fill them with the mean/median
df['customer_lifetime_value'].isnull().sum()

3

In [37]:
# changing the data type to float has been done before
#df['customer_lifetime_value'] = df['customer_lifetime_value'].astype(float)
#df['customer_lifetime_value'].dtypes

In [38]:
print(df['customer_lifetime_value'].describe())
print("The median is:")
print(df['customer_lifetime_value'].median())

count    1.068000e+03
mean     7.936903e+05
std      6.434784e+05
min      2.004351e+05
25%      4.034080e+05
50%      5.881742e+05
75%      8.962872e+05
max      5.816655e+06
Name: customer_lifetime_value, dtype: float64
The median is:
588174.235

In [39]:
df.loc[df['customer_lifetime_value'].isnull(), :]
# the rows with nulls have in common: state, number_of_open_complaints, policy_type, and vehicle_class
# i could calculate the mean clv of all data entries that have as well these variables in common and use this as the clv value
# however, for simlification i will just fill the nulls with the mean of all data entries

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,D,Master,NaN,0.0,1000.0,0,Personal Auto,Four-Door Car,2.704934
78,SP81997,Washington,F,Master,NaN,41275.0,96.0,0,Personal Auto,Four-Door Car,41.122303
988,GT62080,Washington,M,High School or Below,NaN,55561.0,63.0,0,Personal Auto,Four-Door Car,227.872071

In [40]:
df.loc[:,'customer_lifetime_value'] = df['customer_lifetime_value'].fillna(df['customer_lifetime_value'].mean(), axis=0)

In [41]:
# show data that has been filled with the mean value
df.loc[df['customer_lifetime_value']==df['customer_lifetime_value'].mean(), :]

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
0,RB50392,Washington,D,Master,793690.259345,0.0,1000.0,0,Personal Auto,Four-Door Car,2.704934
78,SP81997,Washington,F,Master,793690.259345,41275.0,96.0,0,Personal Auto,Four-Door Car,41.122303
988,GT62080,Washington,M,High School or Below,793690.259345,55561.0,63.0,0,Personal Auto,Four-Door Car,227.872071

#### final check for nulls

In [42]:
# no nulls left
df.isnull().sum()

customer                     0
state                        0
gender                       0
education                    0
customer_lifetime_value      0
income                       0
monthly_premium_auto         0
number_of_open_complaints    0
policy_type                  0
vehicle_class                0
total_claim_amount           0
dtype: int64

#### After formatting data types, as a last step, convert all the numeric variables to integers using applymap().

In [43]:
# most numeric variables are float64, besides number of open complaints
df.dtypes

customer                      object
state                         object
gender                        object
education                     object
customer_lifetime_value      float64
income                       float64
monthly_premium_auto         float64
number_of_open_complaints     object
policy_type                   object
vehicle_class                 object
total_claim_amount           float64
dtype: object

In [44]:
# defining a list with all numeric variables
num_var = ['customer_lifetime_value','income', 'monthly_premium_auto', 'number_of_open_complaints', 'total_claim_amount']
# applying a lambda function that sets them all to be of type integer
df[num_var] = df[num_var].apply(lambda x: x.astype(int))
# i wasnt sure why i should need applymap as apply also works perfectly fine

In [45]:
# checking final data types
df.dtypes

customer                     object
state                        object
gender                       object
education                    object
customer_lifetime_value       int64
income                        int64
monthly_premium_auto          int64
number_of_open_complaints     int64
policy_type                  object
vehicle_class                object
total_claim_amount            int64
dtype: object

## Exercise 5: Dealing with duplicates

Use the `.duplicated()` method to identify any duplicate rows in the dataframe.

Decide on a strategy for handling the duplicates. Options include:
- Dropping all duplicate rows
- Keeping only the first occurrence of each duplicated row
- Keeping only the last occurrence of each duplicated row
- Dropping duplicates based on a subset of columns
- Dropping duplicates based on a specific column

Implement your chosen strategy using the `drop_duplicates()` function.

Verify that your strategy has successfully handled the duplicates by checking for duplicates again using `.duplicated()`.

Remember to document your process and explain your reasoning for choosing a particular strategy for handling duplicates.

Save the cleaned dataset to a new CSV file.

*Hint*: *after dropping duplicates, reset the index to ensure consistency*.

In [46]:
# checking remaining duplicates
df.duplicated().sum()

0

In [47]:
# no duplicates left
# i already dropped the duplicates while i was searching for rows that are only filled with NaNs

In [48]:
# in case i wouldnt have performed that step, I would have done:
# df = df.drop_duplicates()
# reset the index
# df.reset_index()

In [49]:
# saving the cleaned dataset to a new csv file
# seetint index to False to avoid having a column with the indices
df.to_csv('cleaned_dataframe',index = False)

# Bonus: Challenge 2: creating functions on a separate `py` file

Put all the data cleaning and formatting steps into functions, and create a main function that performs all the cleaning and formatting.

Write these functions in separate .py file(s). By putting these steps into functions, we can make the code more modular and easier to maintain.

*Hint: autoreload module is a utility module in Python that allows you to automatically reload modules in the current session when changes are made to the source code. This can be useful in situations where you are actively developing code and want to see the effects of changes you make without having to constantly restart the Python interpreter or Jupyter Notebook kernel.*

In [50]:
%%writefile functions.py

import pandas as pd

def clean_col_name (df: pd.DataFrame) -> pd.DataFrame:
    '''
    Function to apply naming convention to column names.
    Convert all names to lower case strings and replace empty spaces with "_".
    Renames st to state.
    
    Input: df: pd.DataFrame
    Output: New DataFrame with replaced values
    '''
    # make a safety copy
    df2= df.copy()
    
    # convert all to lower case names
    df2.columns = df2.columns.str.lower()
    
    # replacing " " with "_" in column names
    df2.columns = map(lambda x: x.replace(" ","_"), df2.columns)
    
    # to replace the column name "ST" (by now its "st") with "state" the rename() method is applied
    df2 = df2.rename(columns={'st':'state'})
    return df2

def clean_gender (df: pd.DataFrame, column='gender') -> pd.DataFrame:
    '''
    Function cleans by default the "gender" column.
    All entries that are not equal to "F" or "M" will be converted.
    NaNs or Others will be replaced by "D" (Divers, like "not prefer to say").
    
    Input: df: pd.DataFrame
           column: string
    Output: New DataFrame with replaced values
    '''
    # make a safety copy
    df2= df.copy()
    
    # change gender to "F" or "M"
    df2[column] = df2[column].apply(lambda x: x[0].upper() if pd.notnull(x) and x[0].upper() in ['M','F'] else "D")
    
    # replace NaNs by "D"
    #df2 = df.loc[:,column] = df[column].fillna("D", axis=0)
    
    return df2

def clean_state (df: pd.DataFrame, column='state') -> pd.DataFrame:
    '''
    Function cleans by default the "state" column.
    All values that are have an abbreviation listed in state_dict will be converted.
    
    Input: df: pd.DataFrame
           column: string
    Output: New DataFrame with replaced states
    '''
    # make a safety copy
    df2= df.copy()
    
    # creating a dictionary that translates the abbrevations to their full state names
    state_dict = {'AZ':'Arizona','Cali':'California','WA':'Washington'}
    
    # replace each abbrevated state with its full state name on the basis of state_dict
    df2[column] = df2[column].replace(state_dict)
    return df2

def clean_education (df: pd.DataFrame, column='education') -> pd.DataFrame:
    '''
    Function cleans by default the "education" column.
    "Bachelors" will be converted to "Bachelor"
    
    Input: df: pd.DataFrame
           column: string
    Output: New DataFrame with replaced education
    '''
    # make a safety copy
    df2= df.copy()
    
    # replacing 'Bachelors' with 'Bachelor'
    df2[column] = df2[column].replace({'Bachelors':'Bachelor'})
    return df2

def clean_clv (df: pd.DataFrame, column='customer_lifetime_value') -> pd.DataFrame:
    '''
    Function cleans by default the "customer_lifetime_value" column.
    Replaces '%' with nothing ('') and formats it to float.
    
    Input: df: pd.DataFrame
           column: string
    Output: New DataFrame with replaced values
    '''
    # make a safety copy
    df2= df.copy()
    
    # replacing '%' with nothing ('')
    df2[column] = df2[column].apply(lambda x: x.replace('%','') if pd.notnull(x) else x)
    
    
    # changing the data type to float is not working here
    #df2[column] = df2[column].astype(float)
    return df2

def clean_car_class (df: pd.DataFrame, column='vehicle_class') -> pd.DataFrame:
    '''
    Function cleans by default the "vehicle_class" column.
    All values that are listed in car_classes_dict will be converted.
    
    Input: df: pd.DataFrame
           column: string
    Output: New DataFrame with replaced vehicle type
    '''
    # make a safety copy
    df2= df.copy()
    
    # creating a dictionary that converts the values to Luxury
    car_classes_dict = {'Sports Car':'Luxury','Luxury SUV':'Luxury','Luxury Car':'Luxury'}
    
    # replace values listed in car_classes_dict 
    df2[column] = df2[column].replace(car_classes_dict)
    return df2

def split_keep_middle (df: pd.DataFrame, column='number_of_open_complaints') -> pd.DataFrame:
    '''
    Function cleans by default the "number_of_open_complaints" column.
    Splits values by "/" and only keep second string as new variable.
    
    Input: df: pd.DataFrame
           column: string
    Output: New DataFrame with replaced NaNs
    '''
    # make a safety copy
    df2= df.copy()
    
    # splits values by "/" and only keep second string
    df2[column] = df2[column].str.split(pat="/").str[1]
    return df2

def drop_null_rows (df: pd.DataFrame) -> pd.DataFrame:
    '''
    Function deleted rows only containing nulls.
    
    Input: df: pd.DataFrame
    
    Output: New DataFrame with mean to replace nulls
    '''
    # make a safety copy
    df2= df.copy()
    
    # delete null rows
    df2 = df2.dropna(axis=0, how='all')
    return df2


def fill_with_mean (df: pd.DataFrame, column= 'customer_lifetime_value') -> pd.DataFrame:
    '''
    Function filles null values of a given column with mean of the column.
    
    Input: df: pd.DataFrame
           column: string
    Output: New DataFrame with mean to replace nulls
    '''
    # make a safety copy
    df2 = df.copy()
    
    # convert column to numeric
    df2[column] = df2[column].astype(float)
    
    # fill null values with the mean of the column
    df2.loc[:, column] = df2[column].fillna(df2[column].mean(), axis=0)
    return df2

def num_to_int (df: pd.DataFrame) -> pd.DataFrame:
    '''
    Function to convert numeric values to integers.
    
    Input: df: pd.DataFrame
           column: string
    Output: New DataFrame with mean to replace nulls
    '''
    # make a safety copy
    df2 = df.copy()
    
    # defining a list with all numeric variables
    num_var = ['customer_lifetime_value','income', 'monthly_premium_auto', 'number_of_open_complaints', 'total_claim_amount']
    # applying a lambda function that sets them all to be of type integer
    df2[num_var] = df2[num_var].apply(lambda x: x.astype(int))
    return df2

def clean_dataframe (df: pd.DataFrame, column= str) -> pd.DataFrame:
    '''
    Function takes a pd.DataFrame and applies the previous functions to column.
    
    Input: df: pd.DataFrame
           column: string
    Outputs: New DataFram
    '''

    df2 = df.copy()
    df2 = clean_col_name(df)
    df2 = drop_null_rows(df2)
    df2 = clean_gender(df2)
    df2 = clean_state(df2)
    df2 = clean_education(df2)
    df2 = clean_clv(df2)
    df2 = split_keep_middle(df2)
    df2 = fill_with_mean(df2)
    return df2

Overwriting functions.py

In [51]:
#df = clean_dataframe(df)

In [53]:
#df.dtypes

In [54]:
#df.isnull().sum()

# Bonus: Challenge 3: Analyzing Clean and Formated Data

You have been tasked with analyzing the data to identify potential areas for improving customer retention and profitability. Your goal is to identify customers with a high policy claim amount and a low customer lifetime value.

In the Pandas Lab, we only looked at high policy claim amounts because we couldn't look into low customer lifetime values. If we had tried to work with that column, we wouldn't have been able to because customer lifetime value wasn't clean and in its proper format. So after cleaning and formatting the data, let's get some more interesting insights!

Instructions:

- Review the statistics again for total claim amount and customer lifetime value to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount and a low customer lifetime value. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount, and clients with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile and a customer lifetime value in the bottom 25th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount and low customer lifetime value data. To do so, select both columns of the dataframe simultaneously and pass it to the `.describe()` method. This will give you descriptive statistics, such as mean, median, standard deviation, minimum and maximum values for both columns at the same time, allowing you to compare and analyze their characteristics.

In [55]:
df[['total_claim_amount','customer_lifetime_value']].head(3)

   total_claim_amount  customer_lifetime_value
0                   2                   793690
1                1131                   697953
2                 566                  1288743

In [56]:
df[['total_claim_amount','customer_lifetime_value']].describe()

       total_claim_amount  customer_lifetime_value
count         1071.000000             1.071000e+03
mean           404.528478             7.936898e+05
std            293.041850             6.425757e+05
min              0.000000             2.004350e+05
25%            201.500000             4.048530e+05
50%            354.000000             5.887180e+05
75%            532.000000             8.945205e+05
max           2893.000000             5.816655e+06

In [57]:
#customers with a high policy claim amount to be those in the top 25% of the total claim amount, 
#customers with a low customer lifetime value to be those in the bottom 25% of the customer lifetime value. 

high_claim_cust = df['total_claim_amount'].describe()[6]
low_clv_cust = df['customer_lifetime_value'].describe()[4]
print(high_claim_cust)
print(low_clv_cust )

532.0
404853.0

In [58]:
#Create a pandas DataFrame object that contains information about 
#customers with a policy claim amount greater than the 75th percentile 
#and a customer lifetime value in the bottom 25th percentile.

customer_analysis_df = df[(df['total_claim_amount']>=high_claim_cust) & (df['customer_lifetime_value']<=low_clv_cust)]

In [59]:
# Use DataFrame methods to calculate summary statistics about the high policy claim amount 
# and low customer lifetime value data. 
# select both columns of the dataframe simultaneously and pass it to the .describe() method
customer_analysis_df[['total_claim_amount','customer_lifetime_value']].describe()

       total_claim_amount  customer_lifetime_value
count           41.000000                41.000000
mean           718.634146            340055.780488
std            150.337912             57043.697829
min            532.000000            228759.000000
25%            632.000000            289873.000000
50%            679.000000            365253.000000
75%            799.000000            387364.000000
max           1185.000000            402381.000000

In [60]:
customer_analysis_df

,customer,state,gender,education,customer_lifetime_value,income,monthly_premium_auto,number_of_open_complaints,policy_type,vehicle_class,total_claim_amount
17,OE15005,California,D,College,394524,28855,101,0,Personal Auto,SUV,647
23,TZ98966,Nevada,D,Bachelor,245019,0,73,3,Corporate Auto,Four-Door Car,554
26,US89481,California,D,Bachelor,394637,0,111,0,Personal Auto,Four-Door Car,799
38,CM61827,Oregon,D,Bachelor,309003,0,90,0,Personal Auto,Two-Door Car,648
42,IL19217,California,D,Bachelor,393900,60021,99,0,Personal Auto,Four-Door Car,882
62,FG63582,Oregon,D,Bachelor,333976,0,94,0,Personal Auto,Two-Door Car,863
135,MS41162,Arizona,D,High School or Below,402296,0,117,0,Personal Auto,SUV,975
140,DS81757,Oregon,M,College,247012,0,74,0,Personal Auto,Two-Door Car,721
158,KA61892,Arizona,M,College,387364,28142,105,0,Personal Auto,Luxury,701
160,ND87334,California,M,High School or Below,228759,0,63,0,Corporate Auto,Two-Door Car,679
170,TS19868,California,M,College,241313,27501,63,0,Personal Auto,Four-Door Car,542
184,AB13432,California,M,Bachelor,373583,0,110,0,Personal Auto,SUV,792
204,FL34139,California,M,High School or Below,368811,0,63,3,Personal Auto,Four-Door Car,669
250,IA63417,Arizona,F,High School or Below,400151,19782,108,0,Personal Auto,Two-Door Car,773
269,VZ51506,Arizona,F,High School or Below,359531,0,103,0,Corporate Auto,Luxury,741
279,OH60605,Oregon,F,High School or Below,365253,39679,92,0,Personal Auto,Two-Door Car,641
304,RR77985,Oregon,F,Bachelor,288774,0,80,0,Personal Auto,Four-Door Car,676
388,JF36291,California,M,College,387364,28142,105,0,Personal Auto,Luxury,701
415,ZF84449,Oregon,F,College,372672,0,112,1,Special Auto,Luxury,806
448,NL93182,Nevada,M,Bachelor,254945,0,78,0,Corporate Auto,Four-Door Car,845
450,WE68644,Oregon,F,Bachelor,380392,20325,100,0,Personal Auto,Luxury,668
467,AU96286,Oregon,F,Bachelor,316765,0,92,0,Corporate Auto,Four-Door Car,662
486,FY51713,Arizona,F,Bachelor,357076,56168,88,0,Personal Auto,Four-Door Car,614
500,XN11823,Nevada,F,Bachelor,376446,92600,94,0,Corporate Auto,Two-Door Car,842
502,PX17116,Nevada,M,College,362345,0,111,2,Corporate Auto,SUV,1171
545,AW73065,Oregon,F,High School or Below,279190,0,74,0,Personal Auto,Four-Door Car,532
565,XS12556,California,F,College,368309,0,101,0,Corporate Auto,Luxury,564
590,UK41984,Arizona,F,Doctor,383960,0,112,2,Personal Auto,SUV,537
593,ZK21724,Oregon,F,High School or Below,401654,0,111,0,Personal Auto,SUV,799
638,DM95829,California,M,College,252395,16244,68,0,Personal Auto,Two-Door Car,623
645,JA41698,Nevada,M,Bachelor,309953,0,102,5,Corporate Auto,SUV,862
669,ED50963,California,F,High School or Below,268886,32808,68,1,Personal Auto,Four-Door Car,541
709,NZ15548,Oregon,M,Bachelor,402381,41833,103,0,Personal Auto,Four-Door Car,643
788,TE13577,Oregon,F,College,231973,0,64,0,Personal Auto,Four-Door Car,632
853,TV25678,Washington,M,College,354090,0,101,0,Personal Auto,SUV,727
891,KJ87930,California,F,Bachelor,388650,0,112,0,Corporate Auto,SUV,1185
908,XM72420,Arizona,F,High School or Below,391936,66676,97,0,Personal Auto,Four-Door Car,558
949,TD10493,Oregon,F,High School or Below,289873,0,96,4,Personal Auto,Four-Door Car,691
1019,OT52034,California,M,Bachelor,386477,24204,99,1,Personal Auto,Four-Door Car,707
1022,UI73201,California,M,College,366737,62375,92,0,Personal Auto,Two-Door Car,618
1068,GS98873,Arizona,F,Bachelor,323912,16061,88,0,Personal Auto,Four-Door Car,633

#### These are the customers that have a claim amount higher than 75%  of the other customers. They cost (the company) more than the average customer due to their claim amount.
#### Additionally, the also have very low customer lifetime value in comparison to other customers.
#### The customer retention strategy should be adapted to keep these customer category longer as a client.